app/controllers/anexos_controller.rb

  def index
    if params[:unidade].present?
      @anexos = Anexo.all(:conditions => ["unidade_id = ?", params[:unidade]])
---
SELECT * FROM `anexos` WHERE (unidade_id = '72')