app/controllers/estagiarios_controller.rb

  def lista
    @estagiarios = Estagiario.find(:all, :joins => :unidade, :order => 'unidades.nome ASC',:conditions => ['flag=?',0])
    @estagiarios1 = Estagiario.find(:all, :joins => :regiao,  :order => 'regiaos.regiao ASC',:conditions => ['flag=?',0])
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 8)
SELECT `estagiarios`.* FROM `estagiarios` INNER JOIN `unidades` ON `unidades`.id = `estagiarios`.unidade_id WHERE (flag=0) ORDER BY unidades.nome ASC
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 1)

  def index
    if (params[:search].nil? || params[:search].empty?)
      @estagiarios = Estagiario.paginate :page => params[:page], :conditions =>['desligado=?',0], :order => 'nome ASC', :per_page => 10
---
SELECT * FROM `estagiarios` WHERE (desligado=0) ORDER BY nome ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `estagiarios` WHERE (desligado=0)

  def baixas
    if (params[:search].nil? || params[:search].empty?)
     @baixas = Estagiario.find(:all, :order => 'nome ASC', :conditions => ['desligado=?',1])
---
SELECT * FROM `estagiarios` WHERE (nome like '%amanda%' and desligado = 1) ORDER BY nome ASC

  def load_regiaos
      @regiaos = Regiao.find(:all)
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 3)

  def load_unidades
      @unidades = Unidade.find(:all, :order => 'nome ASC')
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 7)