app/controllers/homes_controller.rb

  def index
      @imagens = Noticia.all(:limit => 3, :order => "created_at DESC")
---
SELECT * FROM `noticias` ORDER BY created_at DESC LIMIT 3