app/controllers/unidades_controller.rb

def load_regiaos
    @regiaos = Regiao.find(:all, :order => 'regiao ASC')
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 4)

def load_sem_estagiarios
    @sem_estagiario =Unidade.find(:all, :order => 'nome ASC')
---
SELECT * FROM `unidades` WHERE (estagiarioV=0 or estagiarioM=0 or (estagiarioN=0 and id!=53 and id!=1 and id!=3 and id!=4 and id!=5 and id!=6 and id!=7 and id!=8 and id!=9 and id!=10)) ORDER BY nome ASC

def load_tipos
    @tipos =Tipo.find(:all, :order => 'nome ASC')
---
SELECT * FROM `tipos` WHERE (`tipos`.`id` = 5)

def load_estagiarios
    @estagiarios = Estagiario.find(:all, :order => 'nome ASC')
---
SELECT * FROM `estagiarios` WHERE (`estagiarios`.unidade_id = 8)

  def index
    if (params[:search].nil? || params[:search].empty?)
      #@unidades = Unidade.find(:all, :order => 'nome ASC')
      @unidades = Unidade.paginate :page => params[:page], :order => 'nome ASC', :per_page => 15
---
SELECT * FROM `unidades` ORDER BY nome ASC LIMIT 0, 15
SELECT count(*) AS count_all FROM `unidades`

  def create
    @unidades = Unidade.new(params[:unidade])
    respond_to do |format|
      if @unidades.save
---
INSERT INTO `unidades` (`coordenador`, `created_at`, `regiao_id`, `complemento`, `endereco`, `diretor`, `estagiarioM`, `estagiarioV`, `estagiarioE`, `estagiarioN`, `nome`, `updated_at`, `tipo_id`, `biblioteca`, `cidade`, `ip`, `bairro`, `email`, `num`, `fone`, `obs`) VALUES('SADSDA', '2012-04-24 18:30:17', 1, 'SADSAD', 'DSADSA', 'SDASDA', 0, 0, 1, 0, 'SDADSDS', '2012-04-24 18:30:17', 1, 'sdasda', NULL, 'sadsda', 'SDASDA', 'dsadsadsa', NULL, '', 'SDASDA')

  def update
    @unidades = Unidade.find(params[:id])

    respond_to do |format|
      if @unidades.update_attributes(params[:unidade])
---
UPDATE `unidades` SET `updated_at` = '2012-04-24 14:06:28', `ip` = '123.123.123.123', `biblioteca` = 'Manemane Manemane da Silva' WHERE `id` = 6

def sem_estagiarios
      #@sem_estagiarios = Unidade.find(:all, :order => 'nome ASC')
      @sem_estagiarios= Unidade.find(:all, :conditions => ["estagiarioV=0 or estagiarioM=0 or (estagiarioN=0 and id!=53 and id!=1 and id!=3 and id!=4 and id!=5 and id!=6 and id!=7 and id!=8 and id!=9 and id!=10)"], :order => 'nome ASC')
      #@estagiarios = Estagiario.find(:all, :joins => :unidade, :order => 'unidades.nome ASC',:conditions => ['flag=?',0])
      #@estagiarios1 = Estagiario.find(:all, :joins => :regiao,  :order => 'regiaos.regiao ASC',:conditions => ['flag=?',0])
      #@s2= Unidade.find(:all, :joins => :regiao, :conditions => ['estagiarioE =?',1], :select => 'distinct regiao_id', :order => 'nome ASC')
      #@sem_estagiarios= @s1 + @s2
      #@sem_estagiarios_reg = Estagiario.find(:all,:joins => :regiao,:conditions => ['flag=? and etinerante=?' ,0,1], :select => "distinct regiao_id",  :order => 'regiaos.regiao ASC')

              #@sem_estagiarios_reg = Estagiario.find_by_sql("SELECT * FROM `estagiarios` INNER JOIN `unidades` ON `unidades`.id = `estagiarios`.unidade_id WHERE (flag=0)is not in SELECT * FROM `estagiarios` INNER JOIN `regiaos` ON `regiaos`.id = `estagiarios`.regiao_id WHERE (flag=0) ORDER BY regiaos.regiao ASC")
              #@sem_estagiarios_reg = Estagiario.find_by_sql('SELECT * FROM `estagiarios` INNER JOIN `unidades` ON `unidade`.id = `estagiarios`.unidade_id WHERE (flag=0)is not in SELECT * FROM `estagiarios` INNER JOIN `regiaos` ON `regiaos`.id = `estagiarios`.regiao_id WHERE (flag=0) ORDER BY regiaos.regiao ASC')
              #@sem_estagiarios_reg = Estagiario.find_by_sql("SELECT * FROM `estagiarios` INNER JOIN `regiaos` ON `regiaos`.id = `estagiari' at  SELECT * FROM `estagiarios` INNER JOIN `unidades` ON `unidade`.id = `estagiarios`.unidade_id WHERE (flag=0)is not in SELECT * FROM `estagiarios` INNER JOIN `regiaos` ON `regiaos`.id = `estagiarios`.regiao_id WHERE (flag=0) ORDER BY regiaos.regiao ASC")

    @sem_estagiarios_reg = Estagiario.find(:all,:joins => :regiao,:conditions => ['flag=? and etinerante=?' ,0,1], :select => "distinct regiao_id",  :order => 'regiaos.regiao ASC')
---
SELECT distinct regiao_id FROM `estagiarios` INNER JOIN `regiaos` ON `regiaos`.id = `estagiarios`.regiao_id WHERE (flag=0 and etinerante=1) ORDER BY regiaos.regiao ASC

 def por_endereco
    if (params[:searche].nil? || params[:searche].empty?)
      @unidades = Unidade.paginate :page => params[:page], :order => 'nome ASC', :per_page => 15
---
SELECT * FROM `unidades` ORDER BY nome ASC LIMIT 0, 15
SELECT count(*) AS count_all FROM `unidades`